#Область ОписаниеПеременных

Перем КонтекстЯдра;
Перем Ожидаем;

#КонецОбласти

#Область ИнтерфейсТестирования

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра     = КонтекстЯдраПараметр;
	Ожидаем          = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	НаборТестов.Добавить("ТестДолжен_СложитьДваЧисла");	
	НаборТестов.Добавить("ТестДолжен_СложитьДваЧислаСОшибкой");	
				
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ТестДолжен_СложитьДваЧисла() Экспорт

	ПервоеСлагаемое = 2;
	ВтороеСлагаемое = 2;
	
	Результат = ПервоеСлагаемое + ВтороеСлагаемое;
	
	Ожидаем.Что(Результат, "Результат сложения должен равняться 4")
		.ИмеетТип("Число")
		.Равно(4);

КонецПроцедуры

Процедура ТестДолжен_СложитьДваЧислаСОшибкой() Экспорт

	ПервоеСлагаемое = 20;
	ВтороеСлагаемое = 2;
	
	Результат = ПервоеСлагаемое + ВтороеСлагаемое;
	
	// Тут получим исключение
	Ожидаем.Что(Результат, "Результат сложения должен равняться 22")
		.ИмеетТип("Число")
		.Равно(21);

КонецПроцедуры

#КонецОбласти
